[M_IrisEp2Battle_CoP2 MissionDefinition]
MissionDescription="Compete in Appetite for Destruction, wherein you have to defeat a gang of loosely organized ne'er-do-wells named the Horde of Horrors.<br><br>Tier 2 Difficulty."
TurnInDescription="You've survived the Appetite for Destruction! "

[M_IrisEp2Battle_CoP2:BeatAllRakks MissionObjectiveDefinition]
ProgressMessage="Defeat all rakks"

[M_IrisEp2Battle_CoP3 MissionDefinition]
MissionDescription="Compete in Appetite for Destruction, wherein you have to defeat a gang of loosely organized ne'er-do-wells named the Horde of Horrors.<br><br>Tier 3 Difficulty."
TurnInDescription="You've survived the Appetite for Destruction!"

[M_IrisEp2Battle_CoP3:BeatAllRakks MissionObjectiveDefinition]
ProgressMessage="Defeat all rakks"

[M_IrisEp2Battle_CoPR3 MissionDefinition]
MissionDescription="Compete in Appetite for Destruction, wherein you have to defeat a gang of loosely organized ne'er-do-wells named the Horde of Horrors.<br><br>Tier 3 Difficulty."
TurnInDescription="You've survived the Appetite for Destruction! "

[M_IrisEp2Battle_CoPR3:BeatallBandets4 MissionObjectiveDefinition]
ProgressMessage="Defeat fourth psycho wave"

[M_IrisEp2Battle_CoPR3:BeatAllBruisers4 MissionObjectiveDefinition]
ProgressMessage="Defeat fourth biker wave"

[M_IrisEp2Battle_CoPR3:BeatAllRakks MissionObjectiveDefinition]
ProgressMessage="Defeat all rakks"

[M_IrisEp2Battle_CoPR3:BeatAllThrowers4 MissionObjectiveDefinition]
ProgressMessage="Defeat fourth thrower wave"
